{"config": [{"config": {"bias": true, "b_regularizer": null, "batch_input_shape": [null, 60, 200, 3], "name": "convolution2d_1", "input_dtype": "float32", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "nb_filter": 24, "border_mode": "valid", "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "nb_filter": 36, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "nb_filter": 48, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "trainable": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "activation": "linear", "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [1, 1], "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true, "strides": [1, 1], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "normal", "input_dim": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 1000, "activation": "relu", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense_1", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "normal", "input_dim": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "activation": "relu", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense_2", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "normal", "input_dim": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 20, "activation": "relu", "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "name": "dense_3", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "normal", "input_dim": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear", "W_constraint": null, "name": "dense_4", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}