{"config": [{"config": {"name": "convolution2d_1", "batch_input_shape": [null, 160, 320, 3], "b_regularizer": null, "bias": true, "W_regularizer": null, "subsample": [1, 1], "input_dtype": "float32", "activity_regularizer": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "border_mode": "valid", "activation": "linear", "nb_row": 5, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 28, "name": "dense_1", "W_constraint": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "init": "normal", "activation": "relu", "input_dim": 394368}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "dense_2", "W_constraint": null, "bias": true, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "init": "normal", "activation": "linear", "input_dim": 28}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}