{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 24, "init": "glorot_uniform", "activation": "linear", "bias": true, "batch_input_shape": [null, 60, 200, 3], "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "subsample": [1, 1], "input_dtype": "float32", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "name": "convolution2d_1", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "same"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 36, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 48, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.4}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "W_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [1, 1], "trainable": true, "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.4}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "normal", "output_dim": 1000, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": {"name": "MaxNorm", "axis": 0, "m": 3}, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "normal", "output_dim": 100, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": {"name": "MaxNorm", "axis": 0, "m": 3}, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "normal", "output_dim": 20, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": {"name": "MaxNorm", "axis": 0, "m": 3}, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "normal", "output_dim": 1, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_4", "activation": "tanh"}}], "keras_version": "1.1.1"}